<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Load-the-database" data-toc-modified-id="Load-the-database-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Load the database</a></span></li><li><span><a href="#View" data-toc-modified-id="View-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>View</a></span></li><li><span><a href="#View-examples" data-toc-modified-id="View-examples-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>View examples</a></span></li></ul></div>

# Load the database

In [3]:
import numpy as np
import pandas as pd
import sys
sys.path.append('../utils')

import psycopg2
import util_database
from util_database import *

display(show_method_attributes(util_database))

dbname, dbuser, dbpass, dbport = get_postgres_configs('dvdrental')
%load_ext sql
%sql postgres://postgres:$dbpass@localhost:$dbport/$dbname

,0,1
0,execute_query,show_all_tables_primary_keys
1,get_all_tables_names_in_database,show_df_tables_first_value_and_dtype
2,get_conn,show_given_tables_info
3,get_dataframe_of_all_tables_and_all_columns,show_method_attributes
4,get_pandas_dataframe,show_pandas_dataframes_list
5,get_postgres_configs,show_tables_primary_keys

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: postgres@dvdrental'

# View
- A view helps simplify the complexity of a query
because you can query a view, which is based
on a complex query, using a
simple SELECT statement.
- Like a table, you can grant permission to users
through a view that contains specific data that
the users are authorized to see.
- A view provides a consistent layer even the
columns of underlying table changes.

- To create a view, we use CREATE
VIEW statement.
- The simplest syntax of the CREATE
VIEW statement is as follows:
```SQL
CREATE VIEW view_ - name AS query;
```


![](../images/sql_views.png)

# View examples

In [4]:
%sql select * from customer limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
   postgres://postgres:***@localhost:5432/school
2 rows affected.

[(524, 1, 'Jared', 'Ely', 'jared.ely@sakilacustomer.org', 530, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1),
 (1, 1, 'Mary', 'Smith', 'mary.smith@sakilacustomer.org', 5, True, datetime.date(2006, 2, 14), datetime.datetime(2013, 5, 26, 14, 49, 45, 738000), 1)]

In [5]:
%sql select * from address limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
   postgres://postgres:***@localhost:5432/school
2 rows affected.

[(1, '47 MySakila Drive', None, 'Alberta', 300, '', '', datetime.datetime(2006, 2, 15, 9, 45, 30)),
 (2, '28 MySQL Boulevard', None, 'QLD', 576, '', '', datetime.datetime(2006, 2, 15, 9, 45, 30))]

In [7]:
%%sql
select first_name, last_name, email, address, phone
from customer
join address 
on customer.address_id = address.address_id
limit 2
;

 * postgres://postgres:***@localhost:5432/dvdrental
   postgres://postgres:***@localhost:5432/school
2 rows affected.

[('Mary', 'Smith', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', '28303384290'),
 ('Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', '838635286649')]

In [8]:
%%sql
create view customer_info as
select first_name, last_name, email, address, phone
from customer
join address 
on customer.address_id = address.address_id
limit 2
;

 * postgres://postgres:***@localhost:5432/dvdrental
   postgres://postgres:***@localhost:5432/school
Done.

[]

In [10]:
%sql select * from customer_info limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
   postgres://postgres:***@localhost:5432/school
2 rows affected.

[('Mary', 'Smith', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', '28303384290'),
 ('Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', '838635286649')]

In [11]:
%%sql
alter view customer_info rename to customer_master_list;

 * postgres://postgres:***@localhost:5432/dvdrental
   postgres://postgres:***@localhost:5432/school
Done.

[]

In [18]:
# %sql select * from customer_info;

In [13]:
%sql select * from customer_master_list limit 2;

 * postgres://postgres:***@localhost:5432/dvdrental
   postgres://postgres:***@localhost:5432/school
2 rows affected.

[('Mary', 'Smith', 'mary.smith@sakilacustomer.org', '1913 Hanoi Way', '28303384290'),
 ('Patricia', 'Johnson', 'patricia.johnson@sakilacustomer.org', '1121 Loja Avenue', '838635286649')]

In [17]:
%sql drop view if exists customer_master_list;

 * postgres://postgres:***@localhost:5432/dvdrental
   postgres://postgres:***@localhost:5432/school
Done.

[]